Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter class is used to highlight objects in the model.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter.graphicsDrawer
The graphics drawer.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter.#ctor(Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter class.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter.ClearHighlights
Clears the highlights.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.Highlighter.HighlightPart(Tekla.Structures.Model.Part,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Highlights the part.
part: The part.
lineType: Type of the line.